/**
 * @file numeric.h
 * @brief Центральный заголовочный файл
 *        для определения числовых типов и их пределов.
 *
 * Этот заголовочный файл включает все необходимые файлы для работы как со стандартными,
 * так и с фиксированными числовыми типами и их предельными значениями.
 *
 * Этот файл служит комплексной точкой включения всех числовых типов и их пределов,
 * позволяя коду использовать как стандартные, так и фиксированные типы
 * без необходимости вручную подключать каждый заголовок отдельно.
 */

#ifndef AE_NUMERIC_H
#define AE_NUMERIC_H

#include "numeric_fixed.h"

#endif // AE_NUMERIC_H
