/**
 * @file numeric_fixed.h
 * @brief Заголовочный файл для работы
 *        с числовыми типами фиксированной точности.
 *
 * Этот файл объединяет заголовочные файлы,
 * связанные с числовыми типами фиксированной точности.
 *
 * Он предоставляет определения типов и их пределов,
 * что позволяет работать с фиксированными числовыми типами
 * и выполнять точные арифметические операции, минимизируя ошибки округления.
 *
 * Включаемые файлы:
 * - `numeric_fixed_types.h`:
 *    Определяет типы данных с фиксированной точностью.
 * - `numeric_fixed_limits.h`:
 *    Определяет пределы для числовых типов с фиксированной точностью.
 *
 * @note Использование этого заголовка упрощает управление числовыми типами
 *       фиксированной точности и их границами в проектах,
 *       где важна высокая точность вычислений.
 */

#ifndef AE_NUMERIC_FIXED_H
#define AE_NUMERIC_FIXED_H

#include "numeric_fixed_types.h"
#include "numeric_fixed_limits.h"

#endif // AE_NUMERIC_FIXED_H
