# -------------------------------------------------------------------------------------- #
# Скрипт сбора исходных файлов                                                           #
#                                                                                        #
# Содержит команду для поиска и сбора всех файлов                                        #
# с исходным кодом в указанной директории.                                               #
# -------------------------------------------------------------------------------------- #

file(GLOB AE_TARGET_SOURCE_FILES "${AE_TARGET_SOURCE_DIRECTORY}/*.c")